Test_Clone_Results/Test-Codes/Pywemo/tests/vcr/tests.ouimeaux_device.test_dimmer/Test_PVT_RTOS_Dimmer_v2.test_is_subscribed.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      CALLBACK:
      - <http://192.168.1.1:8989/sub/basicevent>
      Connection:
      - keep-alive
      Content-Length:
      - '0'
      NT:
      - upnp:event
      TIMEOUT:
      - Second-300
      User-Agent:
      - python-requests/2.31.0
    method: SUBSCRIBE
    uri: http://192.168.1.100:49153/upnp/event/basicevent1
  response:
    body:
      string: ''
    headers:
      CONTENT-LENGTH:
      - '0'
      DATE:
      - Mon, 23 Oct 2023 09:03:23
      SERVER:
      - Unspecified, UPnP/1.0, Unspecified
      SID:
      - uuid:8e002dff-79cf-479a-a337-28e03fbdc4a2
      TIMEOUT:
      - Second-1801
      X-User-Agent:
      - redsonic
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version="1.0" encoding="utf-8"?>

      <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

      <s:Body>

      <u:GetBinaryState xmlns:u="urn:Belkin:service:basicevent:1">


      </u:GetBinaryState>

      </s:Body>

      </s:Envelope>'
    headers:
      Content-Type:
      - text/xml
      SOAPACTION:
      - '"urn:Belkin:service:basicevent:1#GetBinaryState"'
    method: POST
    uri: http://192.168.1.100:49153/upnp/control/basicevent1
  response:
    body:
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"\
        http://schemas.xmlsoap.org/soap/encoding/\">\r\n<s:Body>\r\n<u:GetBinaryStateResponse\
        \ xmlns:u=\"urn:Belkin:service:basicevent:1\"><BinaryState>1</BinaryState><brightness>45</brightness></u:GetBinaryStateResponse></s:Body>\r\
        \n</s:Envelope>"
    headers:
      Connection:
      - close
      Content-Length:
      - '310'
      Content-Type:
      - text/xml
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '0'
      SID:
      - uuid:8e002dff-79cf-479a-a337-28e03fbdc4a2
      User-Agent:
      - python-requests/2.31.0
    method: UNSUBSCRIBE
    uri: http://192.168.1.100:49153/upnp/event/basicevent1
  response:
    body:
      string: ''
    headers: {}
    status:
      code: 200
      message: OK
version: 1
